dependencies/multiRegionFoam/tutorials/twoPhaseStratifiedFlow/meshB/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//libs ("libsurfaceTracking.so" "libfvSchemes.so" "libfunctionObjects.so"
//	"libgroovyBC.so" "libfunctionObjectsST.so")

applicationClass    channelBubbleSurfaceTrackFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-4;

cycleWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       1e-5;
minDeltaT       5e-7;

/*functions
(
    bubbleHistory
    {
        type bubbleHistory;
        functionObjectLibs
        (
            "libfunctionObjectsST.so"
        );
    }
    
);*/

// ************************************************************************* //
