dependencies/multiRegionFoam/tutorials/twoPhaseStratifiedFlow/meshB/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform 0;
}

// Fixed values for inlet (p(x=0)) and outlet (p(x=L))
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0021;
    } 
    
// Zero gradient boundary conditions on the walls parallel to the interface   
    Wall
    {
        type            zeroGradient;
    }
    
// Interfacial BC  
    interfaceShadow
    {
        type            interfaceCoupledPressureFlux;
        secondOrder             yes;
        nonOrthCorr             yes;
        neighbourRegionName region0;
        neighbourPatchName interface;
        neighbourFieldName p;
        k               "rhoFluidB";
        value           uniform 0;
    }
    centerline
    {
        type            symmetryPlane;
    }
    upperWedge
    {
        type            wedge;
    }
    lowerWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
